openfoam/OpenFOAM-dev/tutorials/multiRegion/film/VoFToFilm/constant/film/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

filmVoFTransfer
{
    type    filmVoFTransfer;

    deltaFactorToVoF  1.5;
    alphaToVoF        0.9;

    transferRateCoeff 0.1;
}

// ************************************************************************* //
